<?php
error_reporting(0);
function simpleGet(array $dictArray, string $keyStr): string
{
    // 简单取值
    return $dictArray[$keyStr][rand() % count($dictArray[$keyStr])];
}

if (!($_SERVER['REQUEST_METHOD'] === 'POST' && isset($_POST['date'])))
    die('No Flag In Here!');
header('Content-Type: text/plain; charset=UTF-8');
$randomDict = ['a' => ["\${新春欢乐赛:5:1}", "\${新手杯:30:1}"], "d" => ["\${大牛杯:1:1}", "\${吃鸡杯:1:1}", "\${吃瓜杯:1:1}", "\${月饼杯:1:1}", "\${击剑杯:1:1}", "\${击剑杯:6:1}", "\${摆烂杯:1:1}", "\${摆烂杯:6:1}", "\${摆烂杯:30:1}", "\${新春欢乐赛:6:1}", "\${卷王杯:1:1}", "\${卷王杯:6:1}", "\${卷王杯:31:1}", "\${愚人节欢乐赛:1:1}", "\${愚人节欢乐赛:6:1}", "\${愚人节欢乐赛:26:1}", "\${愚人节欢乐赛:28:1}", "\${愚人节欢乐赛:31:1}", "\${单身杯:1:1}", "\${单身杯:6:1}", "\${七夕杯:1:1}", "\${七夕杯:6:1}", "\${新手杯:1:1}", "\${新手杯:6:1}", "\${新手杯:26:1}"], 'e' => ["\${击剑杯:30:1}", "\${新春欢乐赛:4:1}", "\${卷王杯:27:1}", "\${七夕杯:27:1}"], 't' => ["\${大牛杯:19:1}", "\${新春欢乐赛:1:1}", "\${卷王杯:11:1}", "\${卷王杯:26:1}", "\${单身杯:11:1}"]];
die(simpleGet($randomDict, 'd') . simpleGet($randomDict, 'a') . simpleGet($randomDict, 't') . simpleGet($randomDict, 'e')); // 演示一下用法，当然，也是一个提示
